hboughardain/MEMO-H504/PIC32CM5164LS00/Secure/firmware/src/packs/PIC32CM5164LS00064_DFP/component/nvmctrl.h
/* -------- NVMCTRL_ADDR : (NVMCTRL Offset: 0x1C) (R/W 32) Address -------- */
#define NVMCTRL_ADDR_RESETVALUE               _UINT32_(0x00)                                       /*  (NVMCTRL_ADDR) Address  Reset Value */

#define NVMCTRL_ADDR_AOFFSET_Pos              _UINT32_(0)                                          /* (NVMCTRL_ADDR) NVM Address Offset In The Selected Array Position */
#define NVMCTRL_ADDR_AOFFSET_Msk              (_UINT32_(0xFFFF) << NVMCTRL_ADDR_AOFFSET_Pos)       /* (NVMCTRL_ADDR) NVM Address Offset In The Selected Array Mask */
#define NVMCTRL_ADDR_AOFFSET(value)           (NVMCTRL_ADDR_AOFFSET_Msk & (_UINT32_(value) << NVMCTRL_ADDR_AOFFSET_Pos)) /* Assigment of value for AOFFSET in the NVMCTRL_ADDR register */
#define NVMCTRL_ADDR_ARRAY_Pos                _UINT32_(22)                                         /* (NVMCTRL_ADDR) Array Select Position */
#define NVMCTRL_ADDR_ARRAY_Msk                (_UINT32_(0x3) << NVMCTRL_ADDR_ARRAY_Pos)            /* (NVMCTRL_ADDR) Array Select Mask */
#define NVMCTRL_ADDR_ARRAY(value)             (NVMCTRL_ADDR_ARRAY_Msk & (_UINT32_(value) << NVMCTRL_ADDR_ARRAY_Pos)) /* Assigment of value for ARRAY in the NVMCTRL_ADDR register */
#define   NVMCTRL_ADDR_ARRAY_FLASH_Val        _UINT32_(0x0)                                        /* (NVMCTRL_ADDR) FLASH  */
#define   NVMCTRL_ADDR_ARRAY_DATAFLASH_Val    _UINT32_(0x1)                                        /* (NVMCTRL_ADDR) DATA FLASH  */
#define   NVMCTRL_ADDR_ARRAY_NVMROWS_Val      _UINT32_(0x2)                                        /* (NVMCTRL_ADDR) NVM Configuration Rows  */
#define NVMCTRL_ADDR_ARRAY_FLASH              (NVMCTRL_ADDR_ARRAY_FLASH_Val << NVMCTRL_ADDR_ARRAY_Pos) /* (NVMCTRL_ADDR) FLASH Position  */
#define NVMCTRL_ADDR_ARRAY_DATAFLASH          (NVMCTRL_ADDR_ARRAY_DATAFLASH_Val << NVMCTRL_ADDR_ARRAY_Pos) /* (NVMCTRL_ADDR) DATA FLASH Position  */
#define NVMCTRL_ADDR_ARRAY_NVMROWS            (NVMCTRL_ADDR_ARRAY_NVMROWS_Val << NVMCTRL_ADDR_ARRAY_Pos) /* (NVMCTRL_ADDR) NVM Configuration Rows Position  */
#define NVMCTRL_ADDR_Msk                      _UINT32_(0x00C0FFFF)                                 /* (NVMCTRL_ADDR) Register Mask  */


/* -------- NVMCTRL_SULCK : (NVMCTRL Offset: 0x20) (R/W 16) Secure Unlock Register -------- */
#define NVMCTRL_SULCK_BS_Pos                  _UINT16_(0)                                          /* (NVMCTRL_SULCK) Secure Flash (BOOTPROT/BS Region) Position */
#define NVMCTRL_SULCK_BS_Msk                  (_UINT16_(0x1) << NVMCTRL_SULCK_BS_Pos)              /* (NVMCTRL_SULCK) Secure Flash (BOOTPROT/BS Region) Mask */
#define NVMCTRL_SULCK_BS(value)               (NVMCTRL_SULCK_BS_Msk & (_UINT16_(value) << NVMCTRL_SULCK_BS_Pos)) /* Assigment of value for BS in the NVMCTRL_SULCK register */
#define NVMCTRL_SULCK_AS_Pos                  _UINT16_(1)                                          /* (NVMCTRL_SULCK) Secure Flash (AS Region) Position */
#define NVMCTRL_SULCK_AS_Msk                  (_UINT16_(0x1) << NVMCTRL_SULCK_AS_Pos)              /* (NVMCTRL_SULCK) Secure Flash (AS Region) Mask */
#define NVMCTRL_SULCK_AS(value)               (NVMCTRL_SULCK_AS_Msk & (_UINT16_(value) << NVMCTRL_SULCK_AS_Pos)) /* Assigment of value for AS in the NVMCTRL_SULCK register */
#define NVMCTRL_SULCK_DS_Pos                  _UINT16_(2)                                          /* (NVMCTRL_SULCK) Secure Data Flash (DS Region) Position */
#define NVMCTRL_SULCK_DS_Msk                  (_UINT16_(0x1) << NVMCTRL_SULCK_DS_Pos)              /* (NVMCTRL_SULCK) Secure Data Flash (DS Region) Mask */
#define NVMCTRL_SULCK_DS(value)               (NVMCTRL_SULCK_DS_Msk & (_UINT16_(value) << NVMCTRL_SULCK_DS_Pos)) /* Assigment of value for DS in the NVMCTRL_SULCK register */
#define NVMCTRL_SULCK_SLKEY_Pos               _UINT16_(8)                                          /* (NVMCTRL_SULCK) Write Key Position */
#define NVMCTRL_SULCK_SLKEY_Msk               (_UINT16_(0xFF) << NVMCTRL_SULCK_SLKEY_Pos)          /* (NVMCTRL_SULCK) Write Key Mask */
#define NVMCTRL_SULCK_SLKEY(value)            (NVMCTRL_SULCK_SLKEY_Msk & (_UINT16_(value) << NVMCTRL_SULCK_SLKEY_Pos)) /* Assigment of value for SLKEY in the NVMCTRL_SULCK register */
#define   NVMCTRL_SULCK_SLKEY_KEY_Val         _UINT16_(0xA5)                                       /* (NVMCTRL_SULCK) Write Key  */
#define NVMCTRL_SULCK_SLKEY_KEY               (NVMCTRL_SULCK_SLKEY_KEY_Val << NVMCTRL_SULCK_SLKEY_Pos) /* (NVMCTRL_SULCK) Write Key Position  */
#define NVMCTRL_SULCK_Msk                     _UINT16_(0xFF07)                                     /* (NVMCTRL_SULCK) Register Mask  */


/* -------- NVMCTRL_NSULCK : (NVMCTRL Offset: 0x22) (R/W 16) Non-Secure Unlock Register -------- */
#define NVMCTRL_NSULCK_ANS_Pos                _UINT16_(1)                                          /* (NVMCTRL_NSULCK) Non-Secure Flash (ANS Region) Position */
#define NVMCTRL_NSULCK_ANS_Msk                (_UINT16_(0x1) << NVMCTRL_NSULCK_ANS_Pos)            /* (NVMCTRL_NSULCK) Non-Secure Flash (ANS Region) Mask */
#define NVMCTRL_NSULCK_ANS(value)             (NVMCTRL_NSULCK_ANS_Msk & (_UINT16_(value) << NVMCTRL_NSULCK_ANS_Pos)) /* Assigment of value for ANS in the NVMCTRL_NSULCK register */
#define NVMCTRL_NSULCK_DNS_Pos                _UINT16_(2)                                          /* (NVMCTRL_NSULCK) Non-Secure Data Flash (DNS Region) Position */
#define NVMCTRL_NSULCK_DNS_Msk                (_UINT16_(0x1) << NVMCTRL_NSULCK_DNS_Pos)            /* (NVMCTRL_NSULCK) Non-Secure Data Flash (DNS Region) Mask */
#define NVMCTRL_NSULCK_DNS(value)             (NVMCTRL_NSULCK_DNS_Msk & (_UINT16_(value) << NVMCTRL_NSULCK_DNS_Pos)) /* Assigment of value for DNS in the NVMCTRL_NSULCK register */
#define NVMCTRL_NSULCK_NSLKEY_Pos             _UINT16_(8)                                          /* (NVMCTRL_NSULCK) Write Key Position */
#define NVMCTRL_NSULCK_NSLKEY_Msk             (_UINT16_(0xFF) << NVMCTRL_NSULCK_NSLKEY_Pos)        /* (NVMCTRL_NSULCK) Write Key Mask */
#define NVMCTRL_NSULCK_NSLKEY(value)          (NVMCTRL_NSULCK_NSLKEY_Msk & (_UINT16_(value) << NVMCTRL_NSULCK_NSLKEY_Pos)) /* Assigment of value for NSLKEY in the NVMCTRL_NSULCK register */
#define   NVMCTRL_NSULCK_NSLKEY_KEY_Val       _UINT16_(0xA5)                                       /* (NVMCTRL_NSULCK) Write Key  */
#define NVMCTRL_NSULCK_NSLKEY_KEY             (NVMCTRL_NSULCK_NSLKEY_KEY_Val << NVMCTRL_NSULCK_NSLKEY_Pos) /* (NVMCTRL_NSULCK) Write Key Position  */
#define NVMCTRL_NSULCK_Msk                    _UINT16_(0xFF06)                                     /* (NVMCTRL_NSULCK) Register Mask  */


/* -------- NVMCTRL_PARAM : (NVMCTRL Offset: 0x24) (R/W 32) NVM Parameter -------- */
#define NVMCTRL_PARAM_RESETVALUE              _UINT32_(0x00)                                       /*  (NVMCTRL_PARAM) NVM Parameter  Reset Value */

#define NVMCTRL_PARAM_FLASHP_Pos              _UINT32_(0)                                          /* (NVMCTRL_PARAM) FLASH Pages Position */
#define NVMCTRL_PARAM_FLASHP_Msk              (_UINT32_(0xFFFF) << NVMCTRL_PARAM_FLASHP_Pos)       /* (NVMCTRL_PARAM) FLASH Pages Mask */
#define NVMCTRL_PARAM_FLASHP(value)           (NVMCTRL_PARAM_FLASHP_Msk & (_UINT32_(value) << NVMCTRL_PARAM_FLASHP_Pos)) /* Assigment of value for FLASHP in the NVMCTRL_PARAM register */
#define NVMCTRL_PARAM_PSZ_Pos                 _UINT32_(16)                                         /* (NVMCTRL_PARAM) Page Size Position */
#define NVMCTRL_PARAM_PSZ_Msk                 (_UINT32_(0x7) << NVMCTRL_PARAM_PSZ_Pos)             /* (NVMCTRL_PARAM) Page Size Mask */
#define NVMCTRL_PARAM_PSZ(value)              (NVMCTRL_PARAM_PSZ_Msk & (_UINT32_(value) << NVMCTRL_PARAM_PSZ_Pos)) /* Assigment of value for PSZ in the NVMCTRL_PARAM register */
#define   NVMCTRL_PARAM_PSZ_8_Val             _UINT32_(0x0)                                        /* (NVMCTRL_PARAM) 8 bytes  */
#define   NVMCTRL_PARAM_PSZ_16_Val            _UINT32_(0x1)                                        /* (NVMCTRL_PARAM) 16 bytes  */
#define   NVMCTRL_PARAM_PSZ_32_Val            _UINT32_(0x2)                                        /* (NVMCTRL_PARAM) 32 bytes  */
#define   NVMCTRL_PARAM_PSZ_64_Val            _UINT32_(0x3)                                        /* (NVMCTRL_PARAM) 64 bytes  */
#define   NVMCTRL_PARAM_PSZ_128_Val           _UINT32_(0x4)                                        /* (NVMCTRL_PARAM) 128 bytes  */
#define   NVMCTRL_PARAM_PSZ_256_Val           _UINT32_(0x5)                                        /* (NVMCTRL_PARAM) 256 bytes  */
#define   NVMCTRL_PARAM_PSZ_512_Val           _UINT32_(0x6)                                        /* (NVMCTRL_PARAM) 512 bytes  */
#define   NVMCTRL_PARAM_PSZ_1024_Val          _UINT32_(0x7)                                        /* (NVMCTRL_PARAM) 1024 bytes  */
#define NVMCTRL_PARAM_PSZ_8                   (NVMCTRL_PARAM_PSZ_8_Val << NVMCTRL_PARAM_PSZ_Pos)   /* (NVMCTRL_PARAM) 8 bytes Position  */
#define NVMCTRL_PARAM_PSZ_16                  (NVMCTRL_PARAM_PSZ_16_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 16 bytes Position  */
#define NVMCTRL_PARAM_PSZ_32                  (NVMCTRL_PARAM_PSZ_32_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 32 bytes Position  */
#define NVMCTRL_PARAM_PSZ_64                  (NVMCTRL_PARAM_PSZ_64_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 64 bytes Position  */
#define NVMCTRL_PARAM_PSZ_128                 (NVMCTRL_PARAM_PSZ_128_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 128 bytes Position  */
#define NVMCTRL_PARAM_PSZ_256                 (NVMCTRL_PARAM_PSZ_256_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 256 bytes Position  */
#define NVMCTRL_PARAM_PSZ_512                 (NVMCTRL_PARAM_PSZ_512_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 512 bytes Position  */
#define NVMCTRL_PARAM_PSZ_1024                (NVMCTRL_PARAM_PSZ_1024_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 1024 bytes Position  */
#define NVMCTRL_PARAM_DFLASHP_Pos             _UINT32_(20)                                         /* (NVMCTRL_PARAM) DATAFLASH Pages Position */
#define NVMCTRL_PARAM_DFLASHP_Msk             (_UINT32_(0xFFF) << NVMCTRL_PARAM_DFLASHP_Pos)       /* (NVMCTRL_PARAM) DATAFLASH Pages Mask */
#define NVMCTRL_PARAM_DFLASHP(value)          (NVMCTRL_PARAM_DFLASHP_Msk & (_UINT32_(value) << NVMCTRL_PARAM_DFLASHP_Pos)) /* Assigment of value for DFLASHP in the NVMCTRL_PARAM register */
#define NVMCTRL_PARAM_Msk                     _UINT32_(0xFFF7FFFF)                                 /* (NVMCTRL_PARAM) Register Mask  */


/* -------- NVMCTRL_DSCC : (NVMCTRL Offset: 0x30) ( /W 32) Data Scramble Configuration -------- */
#define NVMCTRL_DSCC_RESETVALUE               _UINT32_(0x00)                                       /*  (NVMCTRL_DSCC) Data Scramble Configuration  Reset Value */

#define NVMCTRL_DSCC_DSCKEY_Pos               _UINT32_(0)                                          /* (NVMCTRL_DSCC) Data Scramble Key Position */
#define NVMCTRL_DSCC_DSCKEY_Msk               (_UINT32_(0x3FFFFFFF) << NVMCTRL_DSCC_DSCKEY_Pos)    /* (NVMCTRL_DSCC) Data Scramble Key Mask */
#define NVMCTRL_DSCC_DSCKEY(value)            (NVMCTRL_DSCC_DSCKEY_Msk & (_UINT32_(value) << NVMCTRL_DSCC_DSCKEY_Pos)) /* Assigment of value for DSCKEY in the NVMCTRL_DSCC register */
#define NVMCTRL_DSCC_Msk                      _UINT32_(0x3FFFFFFF)                                 /* (NVMCTRL_DSCC) Register Mask  */


/* -------- NVMCTRL_SECCTRL : (NVMCTRL Offset: 0x34) (R/W 32) Security Control -------- */
#define NVMCTRL_SECCTRL_RESETVALUE            _UINT32_(0x30)                                       /*  (NVMCTRL_SECCTRL) Security Control  Reset Value */

